<?php
return [
    /*
    |--------------------------------------------------------------------------
    | Snowflake Epoch
    |--------------------------------------------------------------------------
    |
    | 在这里您可以配置雪花算法的开始时间。 设置时间
    | 该应用程序已开始开发。 不要设定未来的时间。
    | 如果服务已经运行，请不要更改时间。
    |
    | 参考设置: Y-m-d H:i:s
    |
    */
    'epoch' => env('SNOWFLAKE_EPOCH', '2022-08-08 08:08:08'),

    /*
    |--------------------------------------------------------------------------
    | Snowflake Configuration
    |--------------------------------------------------------------------------
    |
    | 在这里您可以配置雪花的日志设置。
    | 如果您使用多个服务器，请分配唯一的
    | 雪花算法的ID(1-31).
    |
    | 参考设置: 1-31
    |
    */
    'worker_id' => env('SNOWFLAKE_WORKER_ID', 1),

    'datacenter_id' => env('SNOWFLAKE_DATACENTER_ID', 1),
];
